clc
% Задание 1
disp('Задание 1');
disp('');
disp('Искомая матрица А');
A = [6, -1, -1;
    1, -2, 3;
    3, 4, 4]
disp('Детерминант матрицы А');
det(A)
disp('Ранг матрицы А');
rank(A)
disp('Норма матрицы А');
norm(A)
disp('Число обусловленности матрицы А');
cond(A)
disp('Вектор b');
b = [0; 1; -1]
disp('Обратная матрица А');
inv(A) % Нахождение обратной матрицы
disp('Решение');
x = inv(A) * b
disp('Решение с помощью linsolve(A, b)');
linsolve(A, b)
disp('Проверка точности');
b - A*x
disp('');
disp('');
% Задание 2
disp('Задание 2');
disp('');
disp('Искомая матрица А');
A = [2, -1, 0, -3;
    1, -1, 0, 2
    3, -2, 1, 1;
    -1, 3, -1, 1]
disp('Детерминант матрицы А');
det(A)
disp('Ранг матрицы А');
rank(A)
disp('Норма матрицы А');
norm(A)
disp('Число обусловленности матрицы А');
cond(A)
disp('Вектор b');
b = [-9; 8; -5; 9]
x = A \ b
disp('Решение с помощью linsolve(A, b)');
linsolve(A, b)
disp('Проверка точности');
b - A*x
% Задание 3
disp('Задание 3');
disp('');
% LU-разложение
disp('Искомая матрица А');
A = [2.34, -1.42, -0.54, 0.21;
    1.44, -0.53, 1.43, -1.27;
    0.63, -1.32, -0.65, 1.43;
    0.56, 0.88, -0.67, -2.38]
disp('Детерминант матрицы А');
det(A)
disp('Ранг матрицы А');
rank(A)
disp('Норма матрицы А');
norm(A)
disp('Число обусловленности матрицы А');
cond(A)
disp('Вектор b');
b = [0.66; -1.44; 0.94; 0.73]
disp('LU-разложение на матрицы L и U');
[L,U] = lu(A)
y = L \ b
x = U \ y
disp('Решение с помощью linsolve(A, b');
linsolve(A, b)
disp('Проверка тоности');
b - A * x

% Задание 4
disp 'Задание №4';
chim = [1 2 6 0 0; % Ca(NO3)2
        0 0 4 3 1; % H3PO4
        0 1 0 3 0; % NH3
        1 0 4 1 1; % CaHPO4
        0 2 3 4 0; % NH4NO3
        0 1 4 6 1] % NH$H2PO4
A = rank(chim);
disp 'Основная матрица с рангом:';
disp (A);

% Для первой подматрицы
syms b13 b14 b15 b16 b23 b24 b25 b26
disp('Матрица В с неизвестными:');
B = [1 0 b13 b14 b15 b16;
    0 1 b23 b24 b25 b26]
disp('Система уравнений с b:');
umn = B * chim
umn = umn.';
[b13 b14 b15 b16] = solve(umn(:,1));
[b23 b24 b25 b26] = solve(umn(:,2));

B = [1 0 b13 b14 b15 b16;
     0 1 b23 b24 b25 b26;];
B = B.';
disp('Решение для первой подматрицы:');
disp(B);

% Для второй подматрицы
syms b12 b13 b14 b15 b22 b23 b24 b25;
disp('Матрица В с неизвестными:');
B = [1 b12 b13 b14 b15 0;
     0 b22 b23 b24 b25 1;]
disp('Система уравнений с b:');
umn = B*chim
umn = umn.';
[b12 b13 b14 b15] = solve(umn(:,1));
[b22 b23 b24 b25] = solve(umn(:,2));
 
B = [1 b12 b13 b14 b15 0;
     0 b22 b23 b24 b25 1;];
disp('Решение для второй подматрицы:');
B = B.';
disp(B);